---
kind: type
id: T:Autodesk.Revit.DB.ACAObjectPreference
source: html/5847912a-f0b8-1c78-e84f-6426cb07277b.htm
---
# Autodesk.Revit.DB.ACAObjectPreference

An enumerated type listing possible ways to generate geometry of an ACA object
 Revit object parameters used to generate geometry of the exported ACA object.
 Revit object geometry is used to generate geometry of the exported ACA object. That may produce better geometric fidelity in some cases.

## Syntax (C#)
```csharp
public enum ACAObjectPreference
```